# 主窗口文字
WINDOWS_TITLE = "SailVina"

# 切换卡文字
TAB1_TEXT = "准备受体"
TAB2_TEXT = "准备对接配置"
TAB3_TEXT = "准备配体"
TAB4_TEXT = "分子对接"
TAB5_TEXT = "提取分数"
TAB6_TEXT = "生成复合物"
TAB7_TEXT = "关于"

# 帮助文本
TAB1_HELP_TEXT = "本界面用于下载和准备受体文件\n\n" \
                 "操作步骤\n" \
                 "下载受体\n" \
                 "1.输入pdbid（只能输入四位代码）\n" \
                 "2.选择要保存的路径\n" \
                 "3.点击“开始下载”\n\n" \
                 "准备受体\n" \
                 "1.点击“选择受体”选择要进行准备的pdb文件\n" \
                 "2.点击“受体输出路径”选择输入目录。\n" \
                 "3.点击“准备受体”，根据提示操作即可。\n\n" \
                 "说明\n" \
                 "1.提取指定的配体保存为pdbqt格式。点击“配体输出路径”选择提取配体保存的路径。" \
                 "再点击“提取配体”选择特定的配体。\n" \
                 "2.准备受体首先通过Biopython自动修复受体保存为preped.pdb文件，" \
                 "再调用mgltools中的准备受体脚本保存为preped.pdbqt文件。mgltools中的准备脚本会删除所有非标准残基，" \
                 "如果对接验证有问题，建议手动准备受体。"
