# 主窗口文字
WINDOWS_TITLE = "SailVina"

# 切换卡文字
TAB1_TEXT = "准备受体"
TAB2_TEXT = "准备对接配置"
TAB3_TEXT = "准备配体"
TAB4_TEXT = "分子对接"
TAB5_TEXT = "工具"
TAB6_TEXT = "生成复合物"
TAB7_TEXT = "关于"

# 帮助文本
TAB1_HELP_TEXT = "本界面用于下载和准备受体文件\n\n" \
                 "操作步骤\n" \
                 "下载受体\n" \
                 "1.输入pdbid（只能输入四位代码）\n" \
                 "2.选择要保存的路径\n" \
                 "3.点击“开始下载”\n\n" \
                 "准备受体\n" \
                 "1.点击“选择受体”选择要进行准备的pdb文件。可以是单个文件，也可以是包含pdb文件的文件夹\n" \
                 "2.点击“受体输出路径”选择输出目录。\n" \
                 "3.选择需要的参数，点击“准备受体”，根据提示操作即可。\n\n" \
